/* 
   Localizable.strings
   ShareWithFriends

   Created by Niels van Rooij on 04-08-09.
 */
 // General
 "General_YES" = "Yes";
 "General_NO" = "No";
 "General_OK" = "Ok";
 "General_CANCEL" = "Cancel";
 
 // DefaultsController.m
 "DefaultsController_SELECT_MY_CONTACT_TITLE" = "";
 
 // LogFileEntryCell.m
 "LogFileEntryCell_FROM_LBL" = "From: %@";
 "LogFileEntryCell_TO_LBL" = "To: %@";
 
 // LogFileEntry.m
 //--
 
 // SendReceiveLogger.m
 "SendReceiveLogger_CLEAR_LOG_PROMPT_TITLE" = "Clear history:";
 "SendReceiveLogger_CLEAR_LOG_PROMPT_MESSAGE" = "You are about to clear the history.\nDo you want to continue?";
 
 // DeviceCell.m
 "DeviceCell_WAITING_FOR_DEVICES" = "Searching";
 
 // TransmitObjectCell.m
 //--
 
 // rootShareTableViewController.m
  "rootShareTableViewController_MAIN_TITLE" = "Let's Share";

 // settingsTableViewController.m
 "settingsTableViewController_MAIN_TITLE" = "Settings";
 "settingsTableViewController_SETTING_1_TITLE" = "My contact";
 "settingsTableViewController_SETTING_1_TITLE_HEADER" = "Contact information";
 "settingsTableViewController_SETTING_1_TITLE_FOOTER" = "";
 "settingsTableViewController_SETTING_2_TITLE" = "Max: 320 x 320px";
 "settingsTableViewController_SETTING_2_TITLE_HEADER" = "Photo library";
 "settingsTableViewController_SETTING_2_TITLE_FOOTER" = "";
 "settingsTableViewController_SETTING_3_TITLE" = "Clear log";
 "settingsTableViewController_SETTING_3_TITLE_HEADER" = "Logging";
 "settingsTableViewController_SETTING_3_TITLE_FOOTER" = "";
 "settingsTableViewController_SETTING_4_TITLE" = "Version";
 "settingsTableViewController_SETTING_4_TITLE_HEADER" = "Application";
 "settingsTableViewController_SETTING_4_TITLE_FOOTER" = "";
 
 // deviceSelectorTableViewController.m
 "deviceSelectorTableViewController_MAIN_TITLE" = "Share With";
 "deviceSelectorTableViewController_UITABLEVIEWHEADER_SENDING" = "You are about to send %@";
 
 // logTableViewController.m
 "logTableViewController_MAIN_TITLE" = "History";
 "logTableViewController_UITABLEVIEWHEADER_SEND" = "Send";
 "logTableViewController_UITABLEVIEWHEADER_RECEIVED" = "Received";
 
 // multiContactSelectorTableViewController.m
 "multiContactSelectorTableViewController_MAIN_TITLE" = "Select Contacts";
 "multiContactSelectorTableViewController_BUTTON_SHARE" = "Share Selected Contacts";
 "multiContactSelectorTableViewController_CONTACT_PICKER_TITLE" = "Select Contact";
 "multiContactSelectorTableViewController_NO_RECORDS_SELECTED_TITLE" = "No contacts selected.";
 "multiContactSelectorTableViewController_NO_RECORDS_SELECTED_MESSAGE" = "You haven't selected any contacts.\nPlease select contacts using the + sign in the upper right corner.";
 
 // transmitObjectsViewController.m
  "transmitObjectsViewController_MAIN_TITLE" = "Received contacts";
  "transmitObjectsViewController_BUTTON_SAVE_ALL" = "Save All";
  "transmitObjectsViewController_ADDCONTACT_VIEWCONTROLLER_TITLE" = "Received Contact";
  "transmitObjectsViewController_UNSAVED_CONTACTS_ALERT_TITLE" = "Unsaved Contacts:";
  "transmitObjectsViewController_UNSAVED_CONTACTS_ALERT_MESSAGE" = "Some contacts that you have received are not saved.Do you want to proceed and dismiss the receved contacts?";

 // transmitObjectImageViewcontroller.m
  "transmitObjectImageViewcontroller_MAIN_TITLE" = "Received Photo";
  "transmitObjectImageViewcontroller_PROMT_IMAGE_SIZE" = "Photo Size: %@px";
  "transmitObjectImageViewcontroller_BUTTON_SAVE_PHOTO" = "Save Photo";
  "transmitObjectImageViewcontroller_ACTIONSHEET_SAVING_FILE" = "Saving photo with size: %@px to library\nPlease wait.";
  "transmitObjectImageViewcontroller_UNSAVED_PHOTO_ALERT_TITLE" = "Unsaved Photo:";
  "transmitObjectImageViewcontroller_UNSAVED_PHOTO_ALERT_MESSAGE" = "The photo you have received has not been saved to the library. Do you realy want to dismiss the photo?";
  
  // ABRecordSerializer.m
  //--
  
  // TransmitDataHandlerUtility.m
  //--
  
  // TransmitObject.m
  "TransmitObject_CONTACT_LBL" = "contact%@";
  "TransmitObject_CONTACT_LBL_MULTIPLIER" = "s";
  "TransmitObject_IMAGE_LBL" = "photo%@";
  "TransmitObject_IMAGE_LBL_MULTIPLIER" = "s";
  "TransmitObject_DESCRIPTION_CONTACT" = "Contact: %@";
  "TransmitObject_DESCRIPTION_PHOTO" = "Photo: %@";
 
 // SessionManager.m
 //--
  
  // Device.m
  //--
  
  // DevicesManager.m
  //--

  // menuItem.m
  //--
  
  // menuItemCell.m
  //--

  // ShareWithFriendsAppDelegate.m
  "ShareWithFriendsAppDelegate_TABBAR_ITEM_1_TITLE" = "Share";
  "ShareWithFriendsAppDelegate_TABBAR_ITEM_3_TITLE" = "Settings";
  "ShareWithFriendsAppDelegate_MEMORY_WARNING_TITLE" = "Memory Warning";
  "ShareWithFriendsAppDelegate_MEMORY_WARNING_MESSAGE" = "The application has used to much memory and could not clear it. Please relaunch the application.";

  // TransmitDataHandler.m
  "TransmitDataHandler_WAITING_FOR_ACCEPTANCE_PROCESS" = "Waiting for '%@'\nto accept.";
  "TransmitDataHandler_SEND_BUSY_ERROR" = "Busy with another transmission.\nPlease wait or cancel the transmission.";
  "TransmitDataHandler_CONNECTION_ERROR" = "An error has occurred when trying to connect to '%@'.";
  "TransmitDataHandler_RECEIVED_UNRECOGNIGZED_COMMAND" = "An error has occurred during transmission. The current transmission will be closed.\nPlease try again.";
  "TransmitDataHandler_RECEIVED_ERROR_ERROR" = "An error has occurred during transmission. The current transmission will be closed.\nPlease try again.";
  "TransmitDataHandler_PEER_CANCELLED_ERROR" = "The transmission was cancelled by the other host.";
  "TransmitDataHandler_RECEIVED_BUSY_ERROR" = "'%@' is busy with another transmission.\nPlease wait and try again.";
  "TransmitDataHandler_RECEIVE_VIEW_TITLE" = "Incomming transmission:";
  "TransmitDataHandler_RECEIVE_VIEW_MESSAGE" = "'%@' wants to send you: '%@'.\nDo you want to accept?";
  "TransmitDataHandler_RECEPTION_ERROR" = "An error has occurred during transmission. The current transmission will be closed.\nPlease try again.";
  "TransmitDataHandler_RETRY_VIEW_TITLE" = "Transmission refused:";
  "TransmitDataHandler_RETRY_VIEW_MESSAGE" = "The transmission for sending '%@' was refused by '%@'.\nDo you want to retry?";
  "TransmitDataHandler_RECEIVING_PROCESS" = "Receiving '%@'.";
  "TransmitDataHandler_SENDING_PROCESS" = "Sending '%@'.";
  "TransmitDataHandler_ERROR_VIEW_TITLE" = "Transmission Error:";
  "TransmitDataHandler_UNEXPECTED_COMMAND_ERROR" = "An error has occurred during transmission. The current transmission will be closed.\nPlease try again.";
  "TransmitDataHandler_UNEXPECTED_CONNECTION_TIMEDOUT" = "The connection was lost.\nPlease try again.";

  // ShareMenu
  "SECTION_1_TITLE" = "Contact information";
  "SECTION_2_TITLE" = "Photo library";
  "SECTION_1_MENUITEM_1_TITLE" = "My contact";
  "SECTION_1_MENUITEM_1_SUBTITLE" = "Share your personal contact information. ";
  "SECTION_1_MENUITEM_2_TITLE" = "Address book";
  "SECTION_1_MENUITEM_2_SUBTITLE" = "Select one or more contacts form your addressbook.";
  "SECTION_2_MENUITEM_1_TITLE" = "Photo";
  "SECTION_2_MENUITEM_1_SUBTITLE" = "Select a photo to share from your library.";